// Задача 2: Да се изведат на екрана числат от -20 до 50.

public class Task02 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for (int i = -20; i <= 50; i++) {
			System.out.println(i);
		}
	}

}
