/*
Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен ред.
*/
public class Task04 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for (int i = 10; i >= 1; i--) {
			System.out.print(i + " ");
		}
	}

}
