//Задача 1: Да се изведат на екрана числата от 1 до 100.

public class Task01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for (int i = 1; i <= 100; i++) {
			System.out.println(i);
		}
	}

}
